[
  {
    "text": "Verily, with hardship comes ease.",
    "source": "Quran 94:6"
  },
  {
    "text": "Allah does not burden a soul beyond that it can bear.",
    "source": "Quran 2:286"
  },
  {
    "text": "Indeed, Allah is with the patient.",
    "source": "Quran 2:153"
  },
  {
    "text": "Be mindful of Allah, and Allah will protect you. Be mindful of Allah, and you will find Him in front of you.",
    "source": "Hadith, Tirmidhi"
  },
  {
    "text": "The best of you are those who are best to their families.",
    "source": "Hadith, Tirmidhi"
  },
  {
    "text": "The strong person is not the one who can wrestle someone else down. The strong person is the one who can control himself when he is angry.",
    "source": "Hadith, Bukhari"
  },
  {
    "text": "He who is not grateful to the people is not grateful to Allah.",
    "source": "Hadith, Abu Dawud"
  },
  {
    "text": "The Muslim who plants a tree or sows a field, from which man, birds and animals can eat, is committing an act of charity.",
    "source": "Hadith, Muslim"
  },
  {
    "text": "Speak good or remain silent.",
    "source": "Hadith, Bukhari"
  },
  {
    "text": "The best form of charity is giving water to drink.",
    "source": "Hadith, Ibn Majah"
  },
  {
    "text": "Do not lose hope, nor be sad.",
    "source": "Quran 3:139"
  },
  {
    "text": "And when you have decided, then rely upon Allah.",
    "source": "Quran 3:159"
  },
  {
    "text": "And say, 'My Lord, increase me in knowledge.'",
    "source": "Quran 20:114"
  },
  {
    "text": "Verily, Allah loves those who put their trust in Him.",
    "source": "Quran 3:159"
  },
  {
    "text": "For indeed, with hardship will be ease. Indeed, with hardship will be ease.",
    "source": "Quran 94:5-6"
  },
  {
    "text": "So which of the favors of your Lord would you deny?",
    "source": "Quran 55:13"
  },
  {
    "text": "And whoever relies upon Allah - then He is sufficient for him.",
    "source": "Quran 65:3"
  },
  {
    "text": "Indeed, Allah is with those who fear Him and those who are doers of good.",
    "source": "Quran 16:128"
  },
  {
    "text": "So remember Me; I will remember you.",
    "source": "Quran 2:152"
  },
  {
    "text": "And He found you lost and guided you.",
    "source": "Quran 93:7"
  }
]